Revit 2027 API
ParameterTypeId.SpliceByRulesMinLength Property
 "Minimum bar length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpliceByRulesMinLength { get; }
Public Shared ReadOnly Property SpliceByRulesMinLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpliceByRulesMinLength {
	ForgeTypeId^ get ();
}
static member SpliceByRulesMinLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace